const validations = {
  required: 'Обязательно к заполнению',
  name: {
    minLength: {
      value: 2,
      message: `Минимальная длина 2`,
    },
    maxLength: {
      value: 30,
      message: 'Минимальная длина 30'
    },
    pattern: {
      value: /^[-A-Za-zа-яА-ЯёЁ0-9\s]+$/,
      message: "Невалидное имя",
    },
  },
  email: {
    pattern: {
      value: /(?:[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*|"(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21\x23-\x5b\x5d-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])*")@(?:(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?|\[(?:(?:(2(5[0-5]|[0-4][0-9])|1[0-9][0-9]|[1-9]?[0-9]))\.){3}(?:(2(5[0-5]|[0-4][0-9])|1[0-9][0-9]|[1-9]?[0-9])|[a-z0-9-]*[a-z0-9]:(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21-\x5a\x53-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])+)\])/,
      message: "Невалидный email",
    },
  },
};

export default validations;
